stressTest.yaml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 600
      arrivalRate: 50
      name: Sustained load

scenarios:
  - name: "Get reviews"
    flow:
      - get:
          url: "/reviews?product_id=37311"
      - get:
          url: "/reviews/meta?product_id=37311"